# ReferenceBaseOnHost Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ReferenceBaseOnHost Property
ParameterTypeId Class See Also
---
"Reference Base on Host"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ReferenceBaseOnHost { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ReferenceBaseOnHost As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ReferenceBaseOnHost {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace